# Command Line Tools
brew "fish" # fish shell
brew "jq" # JSON processor
brew "terminal-notifier" # notifications
brew "git"
brew "gh" # GitHub CLI
brew "tree"
brew "exiftool"
brew "bat" # better cat
brew "fd" # better find
brew "ripgrep" # better grep
brew "fzf" # fuzzy finder
brew "mas" # Mac App Store CLI

# Applications
cask "iterm2"
cask "arc"
cask "visual-studio-code"
cask "cursor"
cask "1password"
cask "spotify"
cask "imageoptim"
cask "appcleaner"
cask "firefox"
cask "google-chrome"
cask "cloudflare-warp"
cask "swish"
cask "betterdisplay"
cask "deepl"
cask "handbrake"
cask "iina"
cask "keycastr"
cask "orbstack"
cask "pika"
cask "shottr"
cask "rustdesk"
cask "signal"
cask "ghostty"
cask "gitify"
cask "slack" # supports gestures while the mas version does not

# App Store
mas "Gifox", id: 1461845568 # license bought from app store
mas "Telegram", id: 747648890
mas "WhatsApp Messenger", id: 310633997
mas "The Unarchiver", id: 425424353
