brew "fish" # fish shell
brew "jq" # JSON processor
brew "terminal-notifier" # notifications
brew "git"
brew "gh" # GitHub CLI
brew "tree"
brew "exiftool"
brew "bat" # better cat
brew "fd" # better find
brew "ripgrep" # better grep
brew "fzf" # fuzzy finder

cask "iterm2"
cask "arc"
cask "visual-studio-code"
cask "cursor"
cask "1password"
cask "slack"
cask "spotify"
cask "imageoptim"
cask "the-unarchiver"
cask "appcleaner"
cask "firefox"
cask "cloudflare-warp"
cask "swish"
cask "betterdisplay"
cask "deepl"
cask "handbrake"
cask "iina"
cask "keycastr"
cask "orbstack"
cask "pika"
cask "shottr"
